package com.ks.dblab.kshelper.call;

import android.Manifest;
import android.os.AsyncTask;
import android.os.Bundle;
import android.text.Editable;
import android.text.TextWatcher;
import android.view.LayoutInflater;
import android.view.View;
import android.widget.EditText;
import android.widget.Filter;
import android.widget.ProgressBar;
import android.widget.TextView;
import android.widget.Toast;

import com.gun0912.tedpermission.PermissionListener;
import com.gun0912.tedpermission.TedPermission;
import com.ks.dblab.kshelper.R;
import com.ks.dblab.kshelper.activity.BaseActivity;
import com.ks.dblab.kshelper.call.ui.IndexBarView;
import com.ks.dblab.kshelper.call.ui.PinnedHeaderAdapter;
import com.ks.dblab.kshelper.call.ui.PinnedHeaderListView;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.Comparator;
import java.util.Locale;

/**
 * Created by jojo on 2016-07-12.
 */
public class CallActivity extends BaseActivity {

    private static final char HANGUL_BEGIN_UNICODE = 44032; // 가
    private static final char HANGUL_LAST_UNICODE = 55203; // 힣
    private static final char HANGUL_BASE_UNIT = 588;//각자음 마다 가지는 글자수
    private static final char[] INITIAL_SOUND = { 'ㄱ', 'ㄲ', 'ㄴ','ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ','ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ' };

    // an array of countries to display in the list
    static final String[] ITEMS = new String[] {"교목실", "대학본부-처부속실", "대학본부-FAX", "교육연구처-처장", "교육연구처-부처장(학사관리)", "교육연구처-부처장(교원정책)", "학사관리팀-팀장", "학사관리팀-수강신청,성적,계절수업", "학사관리팀-수업", "학사관리팀-강의시수,교육과정", "학사관리팀-종합외래교수실", "학사관리팀-졸업사정,복수(부)전공", "학사관리팀-학적,전과,학력조회", "학사관리팀-학생증(신분증)발급", "학사관리팀-휴·복학", "학사관리팀-학생생애관리", "학사관리팀-FAX", "교원지원팀-팀장 ", "교원지원팀-교원출장, 출/귀국,조교인사,연구소", "교원지원팀-전임교원인사,교원복무,연구년", "교원지원팀-외국인교원인사,교원업적(일반)", "교원지원팀-비전임교원인사,교원업적(산학,강의)", "교원지원팀-FAX", "교직부-부장", "교직부-팀장", "교직부-(대학)교직,실습", "교직부-(교육대학원)교직,실습", "교양지원부-팀장", "교수학습개발센터-소장", "교수학습개발센터-팀장", "교수학습개발센터-e러닝시스템운영", "교수학습개발센터-교수·학습법지원", "교수학습개발센터-28호관1수업 행동분석실 수업지원", "교수학습개발센터-학습법 지원", "교수학습개발센터-학습컨설팅 및 검사", "교수학습개발센터-CT제작 스튜디오", "교수학습개발센터-HD종합편집실", "교수학습개발센터-멀티스튜디오", "교수학습개발센터-27호관 교육매체 지원실", "교수학습개발센터-27호관  교육매체 수업지원", "교수학습개발센터-26호관2수업 행동분석실 수업지원", "교수학습개발센터-멀티미디어소강당", "교수학습개발센터-별관컴퓨터교육지원실", "교수학습개발센터-별관컴퓨터교육실고장신고", "교수학습개발센터-별관디지털출력실", "교수학습개발센터-별관경인쇄실", "교수학습개발센터-26관매체지원실", "교수학습개발센터-28호관 디지털이미지홀 준비실", "교수학습개발센터-29호관 수업지원실", "학생상담센터-소장", "학생상담센터-팀장", "학생상담센터-상담실", "공학교육인증센터-소장", "공학교육인증센터-팀장", "공학교육인증센터-행정실", "학생지원처-처장", "학생지원팀-팀장", "학생지원팀-학생지원(동아리)", "학생지원팀-국가우수,교외장학,대출", "학생지원팀-국가(근로)장학", "학생지원팀-교내장학,근로(국가,교내)", "학생지원팀-국가장학금(1,2유형)", "학생지원팀-FAX", "후생복지팀-팀장", "후생복지팀-사생선발,관리", "후생복지팀-생활관회계", "후생복지팀-식당관리(누리생활관)", "후생복지팀-식당관리(학생회관)", "후생복지팀-식당관리(과학관)", "후생복지팀-사감실(제1누리생활관)", "후생복지팀-사감실(제2누리생활관)", "후생복지팀-FAX", "누리생활관 식당", "학생회관 교직원 식당", "학생회관 학생 식당", "과학관 매점", "학생회관 매점", "누리생활관 매점", "도서관 매점", "문대 매점", "상대 매점", "매장-사진관", "문구점", "안경점", "미용실", "여행사", "기념품점", "핸드폰점", "꽃집", "열쇠,도장", "액서서리점", "이지라이프센터", "복사점(학생회관)", "신라명과", "징코카페(정보관)", "징코카페(도서관)", "부산은행", "우편취급국", "남성신협", "체육부-부장", "체육부-행정실", "체육부-야구부숙소", "체육부-레슬링숙소", "체육부-미식축구부", "체육부-운동장", "체육부-레슬링연습장", "체육부-FAX", "보건진료소-소장 ", "보건진료소-진료실", "하나교육복지센터-소장", "하나교육복지센터-행정실", "기획조정처-처장", "기획조정처-부처장(지표관리)", "기획조정처-부처장(구조개선)", "전략기획팀-팀장", "전략기획팀-전략기획,정원조정", "전략기획팀-대학발전계획,특성화", "전략기획팀-FAX", "예산기획팀-팀장", "예산기획팀-예산(사업비)", "예산기획팀-예산(실험실습비, 출장)", "평가기획팀-팀장", "평가기획팀-정보공시,교육통계,대학평가", "평가기획팀-기타 제반평가,통계연보", "평가기획팀-대학자체평가,학과평가", "입학관리처-처장", "입학관리팀-팀장", "입학관리팀-대표전화", "입학관리팀-정시", "입학관리팀-수시", "입학관리팀-편입학", "입학관리팀-FAX", "대외협력처-처장", "국제교류팀-팀장", "국제교류팀-교환학생,MOU,하계캠프", "국제교류팀-유학생관리,어학연수", "국제교류팀-외국인입학,원어강의", "국제교류팀-글로벌라운지", "국제교류팀-상담 및 민원", "국제교류팀-FAX", "발전협력팀-팀장", "발전협력팀-발전기금 모금", "발전협력팀-발전기금 안내", "발전협력팀-FAX", "한국어학당-소장", "한국어학당-팀장", "한국어학당-행정실", "한국어학당-상담 및 민원", "한국어학당-FAX", "글로벌비즈니스본부-본부장", "글로벌비즈니스본부-행정실", "글로벌비즈니스본부-FAX", "글로벌비즈니스인재센터-행정실", "글로벌비즈니스인재센터-FAX", "행정지원처-처장", "총무팀-팀장", "총무팀-직원인사", "총무팀-사학연금,4대보험", "총무팀-차량등록,주차권발급", "총무팀-개인정보보호,학교차량배차,민방위", "총무팀-행정전자서명인증서", "총무팀-우편물접수실", "총무팀-우편취급국", "총무팀-FAX", "경리팀-팀장", "경리팀-경리", "경리팀-등록", "경리팀-급여,연말정산", "에코캠퍼스팀-팀장", "에코캠퍼스팀-건설공사", "에코캠퍼스팀-시설관리공사", "에코캠퍼스팀-조경,환경", "에코캠퍼스팀-설비,안전", "에코캠퍼스팀-FAX", "에코캠퍼스팀-고장신고", "통합사무실-전기", "통합사무실-목공", "통합사무실-조경", "통합사무실-영선", "통합사무실-냉·난방,수도", "통합사무실-27호관기계실", "통합사무실-철공", "통합사무실-FAX", "통합사무실-미화원대기실", "구매관재팀-팀장", "구매관재팀-사무용구매", "구매관재팀-교육용구매", "구매관재팀-인쇄물", "구매관재팀-비품통계", "구매관재팀-비품관리", "구매관재팀-비품수리,대여", "구매관재팀-FAX", "예비군연대-연대장", "예비군연대-교육훈련", "예비군연대-대원신고", "예비군연대-FAX", "수위실-제2공학관", "수위실-멀티미디어정보관", "수위실-중앙도서관", "수위실-누리생활관", "차량통제소-정문", "차량통제소-동문", "대기실-운전기사", "문화홍보처-처장", "문화기획팀-팀장", "문화기획팀-기획,대관,행정", "문화기획팀-문화공간시설", "문화기획팀-미술관", "문화기획팀-콘서트홀", "문화기획팀-행사안내", "문화기획팀-FAX", "홍보팀-팀장 ", "홍보팀-기획,보도자료", "홍보팀-행사,광고", "홍보팀-대학투어", "홍보팀-디자인관리", "홍보팀-FAX", "조류관-관장", "조류관-연구실", "조류관-FAX", "박물관-관장", "박물관-학예연구실", "박물관-전시실", "박물관-FAX", "취업진로처-처장", "취업지원팀-팀장", "취업지원팀-취업상담", "취업지원팀-취업통계", "취업지원팀-취업,부업추천", "취업지원팀-취업교육,취업방문출장", "취업지원팀-취업교과목", "취업지원팀-FAX", "진로개발팀-팀장", "여대생커리어개발센터-소  장", "여대생커리어개발센터-취업마일리지", "산학협력단-단장", "산학협력단-부단장", "산학협력기획팀-팀장", "산학협력기획팀-연구기획,가족기업", "산학협력기획팀-산학통계,산학교원,협약체결(용역)", "산학협력기획팀-사업기획,협약체결(정부부처)", "산학협력기획팀-현장실습,홈페이지관리", "산학협력기획팀-기타안내", "산학협력기획팀-FAX", "산학사업팀-팀장", "산학사업팀-지적재산권관리,기술이전,학교기업", "산학사업팀-특허 심의위원회", "산학사업팀-FAX", "연구지원관리팀-팀장", "연구지원관리팀-교내연구(연구비,논문게재료)", "연구지원관리팀-교외연구(정부기관,산업체)", "연구지원관리팀-교외연구(교육부,연구재단)", "연구지원관리팀-FAX", "경영지원팀-팀장", "경영지원팀-인사관리", "경영지원팀-회계관리", "경영지원팀-FAX", "중소기업산학협력센터-소장", "중소기업산학협력센터-행정실", "중소기업산학협력센터-FAX", "창업보육센터-소장", "창업보육센터-행정실", "창업보육센터-FAX", "공동기기센터-소장", "공동기기센터-연구지원실(지하)", "공동기기센터-연구지원실(1층)", "현장실습지원센터-센터장", "현장실습지원센터-행정실", "창업보육센터-센터장", "창업보육센터-행정실", "고령친화이지라이프사업단-단장", "고령친화이지라이프사업단-행정실", "고령친화이지라이프사업단-FAX", "유니버설디자인연구센터-센터장", "유니버설디자인연구센터-행정실", "유니버설디자인연구센터-체험관", "유니버설디자인연구센터-FAX", "학교기업 시빅뉴스-대표", "학교기업 시빅뉴스-편집인", "학교기업 시빅뉴스-사무실(편집)", "학교기업 시빅뉴스-사무실(행정 및 회계)", "법무감사실-실장", "법무감사실-팀장", "법무감사실-법무,규정", "법무감사실-감사", "법무감사실-FAX", "씨케이사업단-단장", "씨케이사업단-국장", "씨케이사업단-팀장", "씨케이사업단-CK사무국", "씨케이사업단-FYLs사업단", "씨케이사업단-글로컬사업단 ", "씨케이사업단-ICDT사업단", "씨케이사업단-영화사업단", "씨케이사업단-MP사업단", "창업지원단-단장", "창업지원단-부단장", "창업지원단-행정실", "경성사회봉사단-소장", "경성사회봉사단-팀장", "경성사회봉사단-행정실", "학생군사교육단-단장", "학생군사교육단-행정실", "학생군사교육단-교관실(1)", "학생군사교육단-교관실(2)", "학생군사교육단-명예위원실", "학생군사교육단-FAX", "연구윤리센터-소장", "연구윤리센터-행정실", "연구윤리센터-FAX", "중앙도서관-관장", "학술정보지원팀-팀장 ", "학술정보지원팀-운영지원 ", "학술정보지원팀-기증,실험실습비도서", "학술정보지원팀-연속간행물 구입", "학술정보지원팀-국내도서 구입", "학술정보지원팀-비도서 구입", "학술정보지원팀-국외도서 구입", "학술정보지원팀-자료조직", "학술정보지원팀-FAX", "학술정보서비스팀-팀장", "학술정보서비스팀-이용교육", "학술정보서비스팀-대출,특별허가회원관리", "학술정보서비스팀-반납", "학술정보서비스팀-제1주제자료실(철학,종교,사회)", "학술정보서비스팀-제2주제자료실(언어,문학,역사)", "학술정보서비스팀-제3주제자료실(순수,기술,예술,총류)", "학술정보서비스팀-연속간행물실", "학술정보서비스팀-열람실관리", "학술정보서비스팀-정보검색", "학술정보서비스팀-비도서대출,반납", "학술정보서비스팀-출입안내", "학술정보서비스팀-FAX", "출판부-부장", "출판부-출판", "출판부-FAX", "정보전산원-원장", "개발운영팀-팀장", "개발운영팀-경성포탈,부서정보", "개발운영팀-수업,대학원전산지원", "개발운영팀-인사전산지원", "개발운영팀-전자결재", "개발운영팀-입시전산지원", "개발운영팀-웹메일", "개발운영팀-도서관전산지원", "개발운영팀-학적,장학전산지원", "개발운영팀-SMS", "개발운영팀-유무선네트워크장애신고", "개발운영팀-컴퓨터관리,정보보안", "개발운영팀-IP 관련문의", "개발운영팀-소프트웨어대여", "개발운영팀-컴퓨터고장신고", "개발운영팀-홈페이지", "개발운영팀-학과홈페이지", "개발운영팀-FAX", "평생교육원-원장", "평생교육원-팀장", "사회교육부/어학교육부-사회교육부 안내", "사회교육부/어학교육부-경성골드에이지", "사회교육부/어학교육부-신규과정개설,일반과정", "사회교육부/어학교육부-외부기관사업", "사회교육부/어학교육부-외국어,자격증과정", "사회교육부/어학교육부-어학교육부 안내", "사회교육부/어학교육부-토익수강 안내 ", "사회교육부/어학교육부-산청연수원", "사회교육부/어학교육부-FAX", "스포츠센터-스포츠프로그램 운영", "스포츠센터-체육시설 대관", "스포츠센터-수납 및 회계업무", "스포츠센터-FAX", "엠씨씨-소장", "엠씨씨-MCC지원실", "엠씨씨-방송제작팀", "엠씨씨-취재팀,웹제작팀", "엠씨씨-MCC스튜디오", "기념사업회/복지관-순산기념사업회", "기념사업회/복지관-남구종합사회복지관", "자치단체-교수회", "자치단체-노동조합", "자치단체-총동창회", "자치단체-원우회", "자치단체-민주동문회", "대학원-대학원장", "대학원-교학지원", "경영대학원-대학원장", "경영대학원-교학지원", "경영대학원-최고경영자과정", "경영대학원-FAX", "예술종합대학원-대학원장", "예술종합대학원-교학지원", "교육대학원-대학원장", "교육대학원-교학지원", "사회복지대학원-대학원장", "사회복지대학원-교학부장", "사회복지대학원-교학지원", "임상약학보건대학원-대학원장", "임상약학보건대학원-교학지원", "디지털디자인전문대학원-대학원장", "디지털디자인전문대학원-교학지원", "대학원통합지원팀-교학부장", "대학원통합지원팀-교학지원(일반,디지털디자인전문대학원)", "대학원통합지원팀-교학지원(경영,사회복지,멀티미디어 대학원)", "대학원통합지원팀-교학지원(교육,멀티미디어 대학원)", "대학원통합지원팀-FAX", "문화발전연구소-소장", "유기소자특성화연구소-소장", "디자인&문화콘텐츠연구소-소장 ", "정신건강상담연구소-소장", "문과대학-학장", "문과대학-부학장", "문과대학-제1통합행정실팀장", "문과대학-제1통합행정실", "문과대학-FAX", "문과대학-외래교수실", "문과대학-전산실", "인문문화학부-학부장", "인문문화학부-학부사무실", "인문문화학부-김무식", "인문문화학부-나찬연", "인문문화학부-박훈하", "인문문화학부-황병익(국어국문학)", "인문문화학부-정훈식", "인문문화학부-윤영기(일어일문학)", "인문문화학부-이충렬", "인문문화학부-남미영", "인문문화학부-나카지마", "인문문화학부-김보은", "인문문화학부-정경주", "인문문화학부-박준원(한문학)", "인문문화학부-김철범", "인문문화학부-신승훈", "인문문화학부-조창규", "인문문화학부-강대민", "인문문화학부-백윤목", "인문문화학부-이경일(사학)", "인문문화학부-이순갑", "인문문화학부-국어국문학전공사무실", "인문문화학부-일어일문학전공사무실", "인문문화학부-한문학전공사무실", "인문문화학부-사학전공사무실", "글로컬문화학부-학부장", "글로컬문화학부-학부사무실", "글로컬문화학부-곽병휴", "글로컬문화학부-김영배", "글로컬문화학부-김재기", "글로컬문화학부-박이도", "글로컬문화학부-배영달", "글로컬문화학부-손호은", "글로컬문화학부-이승대", "글로컬문화학부-전영갑", "글로컬문화학부-정을미", "글로컬문화학부-배학수", "글로컬문화학부-레쟈느", "글로컬문화학부-김영리", "글로컬문화학부-김 지 영", "글로컬문화학부-전일수", "글로컬문화학부-신응철", "글로컬문화학부-윤태원", "글로컬문화학부-학과사무실", "철학과-배학수", "철학과-학과사무실", "영어영문학과-최수연", "영어영문학과-나병우", "영어영문학과-이현석", "영어영문학과-심미현 ", "영어영문학과-김철규", "영어영문학과-정철민", "영어영문학과-드웨인스톨스", "영어영문학과-리더", "영어영문학과-강경호", "영어영문학과-학과사무실", "중국학과-이재하", "중국학과-류영표", "중국학과-오창화", "중국학과-하영삼", "중국학과-이화범", "중국학과-곽복선", "중국학과-임형석", "중국학과-양난", "중국학과-여정화", "중국학과-김화영", "중국학과-외래교수실", "중국학과-학과사무실", "중국학과-중어중문학,중국어통번역학", "중국학과-중국통상학과사무실", "문헌정보학과-김영기", "문헌정보학과-이종문", "문헌정보학과-김선애", "문헌정보학과-정종기", "문헌정보학과-학과사무실", "교육학과-김희복  ", "교육학과-강성빈", "교육학과-권형규", "교육학과-천성문", "교육학과-주용국", "교육학과-정숙자", "교육학과-김미옥", "교육학과-이지경", "교육학과-장소은", "교육학과-학과사무실 ", "유아교육과-홍 순 옥", "유아교육과-이연승", "유아교육과-서현아 ", "유아교육과-정지현", "유아교육과-이종길", "유아교육과-학과사무실", "윤리교육과-조경근", "윤리교육과-장세호", "윤리교육과-박장호", "윤리교육과-김상돈", "윤리교육과-학과사무실", "교육인재개발연구소-소장", "영재뇌교육연구소-소장", "유아창의인성교육연구소-소장", "독서교육문화연구소-소장", "글로벌차이나연구소-소장", "법정대학-학장", "법정대학-부학장", "법정대학-제2통합행정실팀장", "법정대학-제2통합행정실", "법정대학-제2통합행정실", "법정대학-FAX", "법정대학-외래교수실", "법정대학-전산실", "법행정정치학부-학 부 장", "법행정정치학부-학부사무실", "법행정정치학부-최문기", "법행정정치학부-왕순모", "법행정정치학부-심재무", "법행정정치학부-박은경", "법행정정치학부-이우석(법학)", "법행정정치학부-손형섭", "법행정정치학부-김주학", "법행정정치학부-송근원", "법행정정치학부-나중식", "법행정정치학부-황수연", "법행정정치학부-배준구", "법행정정치학부-정충식", "법행정정치학부-문유석(행정학)", "법행정정치학부-한동호", "법행정정치학부-송이재", "법행정정치학부-크리스토퍼", "법행정정치학부-공보경", "법행정정치학부-권용립", "법행정정치학부-안철현(정치외교학)", "법행정정치학부-법학전공사무실", "법행정정치학부-행정학전공사무실", "법행정정치학부-정치외교학전공사무실", "커뮤니케이션학부-학부장", "커뮤니케이션학부-학부사무실", "커뮤니케이션학부-정태철", "커뮤니케이션학부-신병률(신문방송학)", "커뮤니케이션학부-정일형", "커뮤니케이션학부-양혜승 ", "커뮤니케이션학부-강성보", "커뮤니케이션학부-강동수", "커뮤니케이션학부-크리스티안", "커뮤니케이션학부-황지영", "커뮤니케이션학부-박기철", "커뮤니케이션학부-송기인", "커뮤니케이션학부-남경태(광고홍보학)", "커뮤니케이션학부-이재봉", "커뮤니케이션학부-신문방송학전공사무실", "커뮤니케이션학부-광고홍보학전공사무실", "사회복지학과-김수환 ", "사회복지학과-김수영", "사회복지학과-김영종", "사회복지학과-손광훈 ", "사회복지학과-정규석", "사회복지학과-진재문", "사회복지학과-최말옥", "사회복지학과-장수지", "사회복지학과-정민경", "사회복지학과-손태홍", "사회복지학과-변영우", "사회복지학과-학과사무실", "법학연구소-소장", "법학연구소-연구실", "상경대학-학장", "상경대학-부학장", "상경대학-제3통합행정실팀장", "상경대학-제3통합행정실", "상경대학-FAX", "상경대학-외래교수실", "상경대학-전산실", "경제금융물류학부-학부장", "경제금융물류학부-학부사무실", "경제금융물류학부-장대익", "경제금융물류학부-최진배", "경제금융물류학부-이재희", "경제금융물류학부-변대호", "경제금융물류학부-김종한(경제금융학)", "경제금융물류학부-김명록", "경제금융물류학부-한윤환", "경제금융물류학부-김태훈", "경제금융물류학부-양재훈(물류학)", "경제금융물류학부-이남형", "경제금융물류학부-강현구", "경제금융물류학부-권용배", "경제금융물류학부-조병도", "경제금융물류학부-경제금융학전공사무실", "경제금융물류학부-물류학전공사무실", "호텔관광외식경영학부-학부장", "호텔관광외식경영학부-학부사무실", "호텔관광외식경영학부-오흥철(호텔관광경역학)", "호텔관광외식경영학부-이미순", "호텔관광외식경영학부-이해영", "호텔관광외식경영학부-얼리드", "호텔관광외식경영학부-한은진", "호텔관광외식경영학부-함성필", "호텔관광외식경영학부-이종호(외식서비스경영학)", "호텔관광외식경영학부-김학선", "호텔관광외식경영학부-이상묵", "호텔관광외식경영학부-호텔관광경영학전공사무실", "호텔관광외식경영학부-외식서비스경영학전공사무실", "경영학과-정기호", "경영학과-이명철", "경영학과-이상식", "경영학과-김후곤", "경영학과-이준섭", "경영학과-정동섭", "경영학과-김천길", "경영학과-성민", "경영학과-김종호", "경영학과-조정은", "경영학과-변영태", "경영학과-이태섭", "경영학과-강동우", "경영학과-이경호", "경영학과-박병석", "경영학과-옥주수", "경영학과-안상모", "경영학과-백수정", "경영학과-이희옥", "경영학과-안경관", "경영학과-이두원", "경영학과-비숍", "경영학과-학과사무실", "국제무역통상학과-권융", "국제무역통상학과-정병우", "국제무역통상학과-박성익", "국제무역통상학과-이우영", "국제무역통상학과-강진욱", "국제무역통상학과-전용복", "국제무역통상학과-김연준", "국제무역통상학과-서영순", "국제무역통상학과-이효상", "국제무역통상학과-한우창", "국제무역통상학과-노정도", "국제무역통상학과-이종진", "국제무역통상학과-노환용", "국제무역통상학과-정문선", "국제무역통상학과-남상달", "국제무역통상학과-학과사무실", "회계학과-정명환", "회계학과-서수덕", "회계학과-이종태", "회계학과-김형순", "회계학과-윤성용", "회계학과-추헌무", "회계학과-배후석", "회계학과-방신석", "회계학과-데이비드", "회계학과-학과사무실", "부동산도시연구소-소장", "이과대학-학장", "이과대학-부학장", "이과대학-제2통합행정실팀장", "이과대학-제2통합행정실", "이과대학-제2통합행정실", "이과대학-FAX", "이과대학-외래교수실", "이과대학-전산실", "수학응용통계학부-학부장", "수학응용통계학부-학부사무실", "수학응용통계학부-한응섭", "이병수수학응용통계학부-", "수학응용통계학부-권오상", "수학응용통계학부-김재겸", "수학응용통계학부-김승원(수학전공)", "수학응용통계학부-정영우", "수학응용통계학부-심영재", "수학응용통계학부-조재근", "수학응용통계학부-조장식", "수학응용통계학부-정기문(응용통계학)", "수학응용통계학부-김미정", "수학응용통계학부-수학전공사무실", "수학응용통계학부-응용통계학전공사무실", "화학생명과학부-학부장", "화학생명과학부-학부사무실", "화학생명과학부-박동규", "화학생명과학부-강대복", "화학생명과학부-권태우", "화학생명과학부-안택(화학전공)", "화학생명과학부-김영복", "화학생명과학부-오명진", "화학생명과학부-문성기", "화학생명과학부-이천복(생명과학전공)", "화학생명과학부-윤명희", "화학생명과학부-조영근", "화학생명과학부-이대원", "화학생명과학부-화학전공사무실 ", "화학생명과학부-생명과학전공사무실", "에너지과학과-이정식", "에너지과학과-조성진", "에너지과학과-이원명", "에너지과학과-권병성", "에너지과학과-하태욱", "에너지과학과-학과사무실", "물리치료학과-한진태", "물리치료학과-구현모", "물리치료학과-이상열", "물리치료학과-이은주", "물리치료학과-학과사무실", "간호학과-최원희", "간호학과-구혜자", "간호학과-박지연", "간호학과-윤혜선", "간호학과-이재영", "간호학과-이성화", "간호학과-학과사무실", "식품영양건강생활학과-학과사무실", "기초과학연구소-소장", "공과대학-학장", "공과대학-부학장", "공과대학-제1통합행정실팀장", "공과대학-제1통합행정실", "공과대학-FAX", "공과대학-외래교수실", "공과대학-전산실", "건설환경도시공학부-학부장", "건설환경도시공학부-학부사무실", "건설환경도시공학부-이재복(환경공학)", "건설환경도시공학부-엄태규", "건설환경도시공학부-정장표", "건설환경도시공학부-신용섭", "건설환경도시공학부-신현무", "건설환경도시공학부-임수빈", "건설환경도시공학부-김해창", "건설환경도시공학부-김충호", "건설환경도시공학부-윤종태", "건설환경도시공학부-김성도", "건설환경도시공학부-최용규", "건설환경도시공학부-이남주", "건설환경도시공학부-문도영(토목공학)", "건설환경도시공학부-박충환", "건설환경도시공학부-김민수", "건설환경도시공학부-이석환", "건설환경도시공학부-강동진(도시공학)", "건설환경도시공학부-남광우", "건설환경도시공학부-신강원", "건설환경도시공학부-이승희", "건설환경도시공학부-김재민", "건설환경도시공학부-손봉균", "건설환경도시공학부-윤병호", "건설환경도시공학부-환경공학전공사무실", "건설환경도시공학부-토목공학전공사무실", "건설환경도시공학부-도시공학전공사무실", "전기전자공학부-학부장", "전기전자공학부-학부사무실", "전기전자공학부-윤병우", "전기전자공학부-송종관", "전기전자공학부-김성만", "전기전자공학부-박장식(전자공학)", "전기전자공학부-김상열", "전기전자공학부-곽동주", "전기전자공학부-이명규", "전기전자공학부-정정원", "전기전자공학부-성열문", "전기전자공학부-최군호(전기공학)", "전기전자공학부-이홍규", "전기전자공학부-김두환", "전기전자공학부-김준환", "전기전자공학부-송미화", "전기전자공학부-전자공학전공사무실", "전기전자공학부-전기공학전공사무실", "융합시스템공학부-학부장", "융합시스템공학부-학부사무실", "융합시스템공학부-안진우", "융합시스템공학부-이동희", "융합시스템공학부-김병호", "융합시스템공학부-제우성(메카트로닉스)", "융합시스템공학부-김정현", "융합시스템공학부-최주용", "융합시스템공학부-수레쉬", "융합시스템공학부-바스카라", "융합시스템공학부-서진요", "융합시스템공학부-김홍배", "융합시스템공학부-양성민", "융합시스템공학부-차명수", "융합시스템공학부-고창성(산업경영)", "융합시스템공학부-김태운", "융합시스템공학부-정홍인", "융합시스템공학부-이성훈", "융합시스템공학부-김용후", "융합시스템공학부-이해경", "융합시스템공학부-정원재", "융합시스템공학부-메카트로닉스전공사무실", "융합시스템공학부-산업경영전공사무실", "식품응용공학부-학부장", "식품응용공학부-학부사무실", "식품응용공학부-이진호", "식품응용공학부-정종연(식품생명공학)", "식품응용공학부-김영화", "식품응용공학부-정경화", "식품응용공학부-조용철", "식품응용공학부-노재경(식품영양학)＊", "식품응용공학부-강혜경", "식품응용공학부-이경옥", "식품응용공학부-오초롱", "식품응용공학부-식품생명공학전공사무실", "식품응용공학부-식품영양학전공사무실", "건축디자인학부-학부장", "건축디자인학부-학부사무실", "건축디자인학부-강혁", "건축디자인학부-김진원", "건축디자인학부-현철(건축학)", "건축디자인학부-정연근", "건축디자인학부-김종국", "건축디자인학부-신선화", "건축디자인학부-하호진", "건축디자인학부-이창노(실내건축디자인학)", "건축디자인학부-오선애", "건축디자인학부-최강림", "건축디자인학부-강재영", "건축디자인학부-건축학전공사무실", "건축디자인학부-실내건축디자인학전공사무실", "컴퓨터공학과-양태천", "컴퓨터공학과-성낙운", "컴퓨터공학과-김영택", "컴퓨터공학과-이종혁", "컴퓨터공학과-양희재", "컴퓨터공학과-권중장", "컴퓨터공학과-김진천", "컴퓨터공학과-최재원", "컴퓨터공학과-홍석희", "컴퓨터공학과-변석우", "컴퓨터공학과-지상문", "컴퓨터공학과-김병호", "컴퓨터공학과-강인수", "컴퓨터공학과-김주연", "컴퓨터공학과-전주현", "컴퓨터공학과-학과사무실", "정보통신공학과-신광호", "정보통신공학과-김진우", "정보통신공학과-김종성", "정보통신공학과-학과사무실", "신소재공학과-최태운", "신소재공학과-이세종", "신소재공학과-이주신", "신소재공학과-박민우", "신소재공학과-안영철", "신소재공학과-김충기", "신소재공학과-학과사무실", "식품생명과학연구소-소장", "스마트메카트로닉스연구소소장", "보안문제연구소-소장", "약학대학-학장", "약학대학-제1통합행정실팀장", "약학대학-제1통합행정실", "약학대학-FAX", "약학대학-전산실", "약학과-문경호", "약학과-신영희", "약학과-강재선", "약학과-손기호", "약학과-백인환", "약학과-표재성", "약학과-곽재환", "약학과-김혜경", "약학과-최윤림", "약학과-학과사무실", "약학연구소-소장", "예술종합대학-학장", "예술종합대학-부학장", "예술종합대학-제3통합행정실팀장", "예술종합대학-제3통합행정실", "예술종합대학-FAX", "예술종합대학-제1전산실", "예술종합대학-제2전산실", "스포츠건강학부-학부장", "스포츠건강학부-학부사무실", "스포츠건강학부-이준희", "스포츠건강학부-박종진", "스포츠건강학부-최승준(체육학)", "스포츠건강학부-전병환(스포츠의학)", "스포츠건강학부-우혜인", "스포츠건강학부-이정아", "스포츠건강학부-조현민", "스포츠건강학부-체육학전공사무실", "스포츠건강학부-스포츠의학전공사무실", "스포츠건강학부-운동과학실험실", "음악학부-학부장", "음악학부-학부사무실", "음악학부-조현선", "음악학부-황정미", "음악학부-임병원", "음악학부-이기균", "음악학부-김성규", "음악학부-최윤희", "음악학부-정경님", "음악학부-김원명", "음악학부-김종욱", "음악학부-김가영", "음악학부-알렉세이", "음악학부-음악도서실", "디자인학부-학부장", "디자인학부-학부사무실", "디자인학부-정한경(시각디자인학)", "디자인학부-고영진", "디자인학부-이방원", "디자인학부-정찬수(제품디자인학)", "디자인학부-이호숭", "디자인학부-김현정", "디자인학부-이해구", "디자인학부-박봉관", "디자인학부-시각디자인학전공사무실", "디자인학부-제품디자인학전공사무실", "연극영화학부-학부장", "연극영화학부-학부사무실", "연극영화학부-허은", "연극영화학부-이성섭(연극)", "연극영화학부-한진수", "연극영화학부-이기호", "연극영화학부-김숙경", "연극영화학부-전수일", "연극영화학부-양영철", "연극영화학부-남명지", "연극영화학부-김진해", "연극영화학부-강내영(영화)", "연극영화학부-조재현", "연극영화학부-김상오", "연극영화학부-안동규", "연극영화학부-김영진", "연극영화학부-조창주", "연극영화학부-유상곤", "연극영화학부-연극전공사무실", "연극영화학부-영화전공사무실", "영상애니메이션학부-학부장", "영상애니메이션학부-학부사무실", "영상애니메이션학부-오종환(영상학)", "영상애니메이션학부-이상조", "영상애니메이션학부-백성웅", "영상애니메이션학부-유왕윤", "영상애니메이션학부-최성규", "영상애니메이션학부-김경애", "영상애니메이션학부-박민주", "영상애니메이션학부-이석호(애니메이션학)", "영상애니메이션학부-영상학전공사무실", "영상애니메이션학부-애니메이션학전공사무실", "디지털미디어학부-학부장", "디지털미디어학부-학부사무실", "디지털미디어학부-FAX", "디지털미디어학부-김재명", "디지털미디어학부-권만우", "디지털미디어학부-김선진", "디지털미디어학부-이상호", "디지털미디어학부-이인혜", "디지털미디어학부-백상훈", "미술학과-박소현", "미술학과-심준섭", "미술학과-학과사무실", "공예디자인학과-권향아", "공예디자인학과-권상인", "공예디자인학과-김진옥", "공예디자인학과-정희균", "공예디자인학과-김지은", "공예디자인학과-김태환", "공예디자인학과-박민찬", "공예디자인학과-박수용", "공예디자인학과-학과사무실", "공예디자인학과-도자기실", "무용학과-최은희", "무용학과-신정희", "무용학과-한혜리", "무용학과-학과사무실", "사진학과-오승환", "사진학과-이재구", "사진학과-황철희", "사진학과-김강", "사진학과-김문정", "사진학과-학과사무실", "패션디자인학과-박옥련", "패션디자인학과-박숙현", "패션디자인학과-김호정", "패션디자인학과-이영주", "패션디자인학과-이경림", "패션디자인학과-장성환", "패션디자인학과-박근수", "패션디자인학과-신장희", "패션디자인학과-학과사무실", "스포츠건강과학연구소-소장", "멀티미디어산학연구소-소장", "신학과-나동광", "신학과-김은정", "신학과-김충만", "신학과-학과사무실", "신학과-FAX", "신학과-전산실", "단과대학통합행정실-팀장", "창의인재대학-학장", "교양교육부-팀장", "교양교육부-행정실", "교양교육부-FAX", "교양교육부-부속실", "교양교육부-강기남", "교양교육부-류은정", "교양교육부-김병환", "교양교육부-김지숙", "교양교육부-선혜진", "교양교육부-이자형", "교양교육부-한미경", "교양교육부-김영희", "교양교육부-김희진", "교양교육부-김미라", "교양교육부-심경옥", "교양교육부-전광수", "교양교육부-이소의", "교양교육부-이재경", "교양교육부-김옥선", "교양교육부-김세경", "교양교육부-정재형", "교양교육부-로버트", "교양교육부-죤,제프,메이", "교양교육부-흄즈,토마스", "교양교육부-인드라", "교양교육부-레스터,크리스", "교양교육부-칼,마이클", "교양교육부-하젤", "교양교육부-실용영어회화담당", "교양교육부-실용영어담당", "인성교육센터-소장", "인문과학연구소-소장", "인문과학연구소-연구실", "한국학연구소-소장", "한국학연구소-연구실", "사회과학연구소-소장", "사회과학연구소-연구실", "산업개발연구소-소장", "산업개발연구소-연구실", "공학기술연구소-소장", "공학기술연구소-연구실", "환경문제연구소-소장", "환경문제연구소-연구실", "한국한자연구소-소장", "한국한자연구소-연구실", "학생회-총학생회장", "학생회-총학생회", "학생회-문과대학생회", "학생회-법정대학생회", "학생회-상경대학생회", "학생회-이과대학생회", "학생회-공과대학생회", "학생회-약학대학생회", "학생회-예술종합대학생회", "학생회-도서관자치위원회", "학생회-동아리연합회", "학생회-대학원학생회", "문과대학회-국어국문학", "문과대학회-일어일문학", "문과대학회-한문학", "문과대학회-사학", "문과대학회-글로컬문화학부", "문과대학회-프랑스지역학", "문과대학회-독일지역학", "문과대학회-철학", "문과대학회-영어영문학", "문과대학회-중국학", "문과대학회-문헌정보학", "문과대학회-교육학", "문과대학회-유아교육", "문과대학회-윤리교육", "법정대학회-법학", "법정대학회-행정학", "법정대학회-정치외교학", "법정대학회-신문방송학", "법정대학회-광고홍보학", "법정대학회-사회복지학", "상경대학회-경제금융학", "상경대학회-물류학", "상경대학회-호텔관광경영학", "상경대학회-외식서비스경영학", "상경대학회-경영학", "상경대학회-국제무역통상학", "상경대학회-회계학", "이과대학회-수학", "이과대학회-응용통계학", "이과대학회-화학", "이과대학회-생명과학", "이과대학회-에너지과학", "이과대학회-물리치료학", "이과대학회-간호학", "이과대학회-식품영양·건강생활학", "공과대학회-환경공학", "공과대학회-토목공학", "공과대학회-도시공학", "공과대학회-전자공학", "공과대학회-전기공학", "공과대학회-메카트로닉스", "공과대학회-산업경영", "공과대학회-식품생명공학", "공과대학회-식품영양학", "공과대학회-건축학", "공과대학회-실내건축디자인학", "공과대학회-컴퓨터공학", "공과대학회-정보통신공학", "공과대학회-신소재공학", "약학대학회-약학", "예술종합대학회-체육학", "예술종합대학회-스포츠의학", "예술종합대학회-음악학", "예술종합대학회-시각디자인학", "예술종합대학회-제품디자인학", "예술종합대학회-연극학", "예술종합대학회-영화학", "예술종합대학회-영상학", "예술종합대학회-애니메이션학", "예술종합대학회-디지털미디어", "예술종합대학회-미술학", "예술종합대학회-공예디자인학", "예술종합대학회-무용학", "예술종합대학회-사진학", "예술종합대학회-패션디자인학", "예술종합대학회-신학"};

    // unsorted list items
    ArrayList<String> mItems;

    // array list to store section positions
    ArrayList<Integer> mListSectionPos;

    // array list to store listView data
    ArrayList<String> mListItems;

    // custom list view with pinned header
    PinnedHeaderListView mListView;

    // custom adapter
    PinnedHeaderAdapter mAdaptor;

    // search box
    EditText mSearchView;

    // loading view
    ProgressBar mLoadingView;

    // empty view
    TextView mEmptyView;

    @Override
    protected void createActivity(final Bundle savedInstanceState) {
        View view = this.setContainerView(R.layout.activity_call);
        getSupportActionBar().setTitle("교내 전화");

        // UI elements
        mSearchView = (EditText) findViewById(R.id.search_view);
        mLoadingView = (ProgressBar) findViewById(R.id.loading_view);
        mListView = (PinnedHeaderListView) findViewById(R.id.list_view);
        mEmptyView = (TextView) findViewById(R.id.empty_view);

        // Array to ArrayList
        mItems = new ArrayList<String>(Arrays.asList(ITEMS));
        mListSectionPos = new ArrayList<Integer>();
        mListItems = new ArrayList<String>();

        PermissionListener permissionlistener = new PermissionListener() {
            @Override
            public void onPermissionGranted() {
                //Toast.makeText(CallActivity.this, "Permission Granted", Toast.LENGTH_SHORT).show();

                // for handling configuration change
                if (savedInstanceState != null) {
                    mListItems = savedInstanceState.getStringArrayList("mListItems");
                    mListSectionPos = savedInstanceState.getIntegerArrayList("mListSectionPos");

                    if (mListItems != null && mListItems.size() > 0 && mListSectionPos != null && mListSectionPos.size() > 0) {
                        setListAdaptor();
                    }

                    String constraint = savedInstanceState.getString("constraint");
                    if (constraint != null && constraint.length() > 0) {
                        mSearchView.setText(constraint);
                        setIndexBarViewVisibility(constraint);
                    }
                } else {
                    new Poplulate().execute(mItems);
                }
            }

            @Override
            public void onPermissionDenied(ArrayList<String> deniedPermissions) {
                Toast.makeText(CallActivity.this, "권한이 없습니다.\n" + deniedPermissions.toString(), Toast.LENGTH_SHORT).show();
            }
        };

        new TedPermission(this)
                .setPermissionListener(permissionlistener)
                .setDeniedMessage("만약 권한을 거부하시게 되면 해당 서비스를 사용하실 수 없습니다.\n(해당 권한은 전화걸기 화면을 불러오기 위해 필요한 권한입니다.)\n권한을 허용 하시려면 [설정] > [권한] 에서 설정해 주세요.")
                .setPermissions(Manifest.permission.CALL_PHONE)
                .check();
    }

    @Override
    protected void onPostCreate(Bundle savedInstanceState) {
        mSearchView.addTextChangedListener(filterTextWatcher);
        super.onPostCreate(savedInstanceState);
    }

    private void setListAdaptor() {
        // create instance of PinnedHeaderAdapter and set adapter to list view
        mAdaptor = new PinnedHeaderAdapter(this, mListItems, mListSectionPos);
        mListView.setAdapter(mAdaptor);

        LayoutInflater inflater = (LayoutInflater) getSystemService(LAYOUT_INFLATER_SERVICE);

        // set header view
        View pinnedHeaderView = inflater.inflate(R.layout.item_indexer_section_row_view, mListView, false);
        mListView.setPinnedHeaderView(pinnedHeaderView);

        // set index bar view
        IndexBarView indexBarView = (IndexBarView) inflater.inflate(R.layout.item_indexer_index_bar_view, mListView, false);
        indexBarView.setData(mListView, mListItems, mListSectionPos);
        mListView.setIndexBarView(indexBarView);

        // set preview text view
        View previewTextView = inflater.inflate(R.layout.item_indexer_preview_view, mListView, false);
        mListView.setPreviewView(previewTextView);

        // for configure pinned header view on scroll change
        mListView.setOnScrollListener(mAdaptor);
    }

    private TextWatcher filterTextWatcher = new TextWatcher() {
        public void afterTextChanged(Editable s) {
            String str = s.toString();
            if (mAdaptor != null && str != null)
                mAdaptor.getFilter().filter(str);
        }

        public void beforeTextChanged(CharSequence s, int start, int count, int after) {
        }

        public void onTextChanged(CharSequence s, int start, int before, int count) {

        }
    };

    public class ListFilter extends Filter {
        @Override
        protected FilterResults performFiltering(CharSequence constraint) {
            // NOTE: this function is *always* called from a background thread,
            // and
            // not the UI thread.
            String constraintStr = constraint.toString().toLowerCase(Locale.getDefault());
            FilterResults result = new FilterResults();

            if (constraint != null && constraint.toString().length() > 0) {
                ArrayList<String> filterItems = new ArrayList<String>();

                synchronized (this) {
                    for (String item : mItems) {
                        //if (item.toLowerCase(Locale.getDefault()).startsWith(constraintStr)) {
                        if (item.toLowerCase(Locale.getDefault()).contains(constraintStr)) {
                            filterItems.add(item);
                        }
                    }
                    result.count = filterItems.size();
                    result.values = filterItems;
                }
            } else {
                synchronized (this) {
                    result.count = mItems.size();
                    result.values = mItems;
                }
            }
            return result;
        }

        @SuppressWarnings("unchecked")
        @Override
        protected void publishResults(CharSequence constraint, FilterResults results) {
            ArrayList<String> filtered = (ArrayList<String>) results.values;
            setIndexBarViewVisibility(constraint.toString());
            // sort array and extract sections in background Thread
            new Poplulate().execute(filtered);
        }

    }

    private void setIndexBarViewVisibility(String constraint) {
        // hide index bar for search results
        if (constraint != null && constraint.length() > 0) {
            mListView.setIndexBarVisibility(false);
        } else {
            mListView.setIndexBarVisibility(true);
        }
    }

    // sort array and extract sections in background Thread here we use
    // AsyncTask
    private class Poplulate extends AsyncTask<ArrayList<String>, Void, Void> {

        private void showLoading(View contentView, View loadingView, View emptyView) {
            contentView.setVisibility(View.GONE);
            loadingView.setVisibility(View.VISIBLE);
            emptyView.setVisibility(View.GONE);
        }

        private void showContent(View contentView, View loadingView, View emptyView) {
            contentView.setVisibility(View.VISIBLE);
            loadingView.setVisibility(View.GONE);
            emptyView.setVisibility(View.GONE);
        }

        private void showEmptyText(View contentView, View loadingView, View emptyView) {
            contentView.setVisibility(View.GONE);
            loadingView.setVisibility(View.GONE);
            emptyView.setVisibility(View.VISIBLE);
        }

        @Override
        protected void onPreExecute() {
            // show loading indicator
            showLoading(mListView, mLoadingView, mEmptyView);
            super.onPreExecute();
        }

        @Override
        protected Void doInBackground(ArrayList<String>... params) {
            mListItems.clear();
            mListSectionPos.clear();
            ArrayList<String> items = params[0];
            if (mItems.size() > 0) {

                // NOT forget to sort array
                Collections.sort(items, new SortIgnoreCase());

                String prev_section = "";
                for (String current_item : items) {
                    //String current_section = current_item.substring(0, 1).toUpperCase(Locale.getDefault());
                    String current_section = getInitialSound(current_item.charAt(0)) + "";

                    if (!prev_section.equals(current_section)) {
                        mListItems.add(current_section);
                        mListItems.add(current_item);
                        // array list of section positions
                        mListSectionPos.add(mListItems.indexOf(current_section));
                        prev_section = current_section;
                    } else {
                        mListItems.add(current_item);
                    }
                }
            }
            return null;
        }

        private char getInitialSound(char c) {
            int hanBegin = (c - HANGUL_BEGIN_UNICODE);
            int index = hanBegin / HANGUL_BASE_UNIT;
            return INITIAL_SOUND[index];
        }

        @Override
        protected void onPostExecute(Void result) {
            if (!isCancelled()) {
                if (mListItems.size() <= 0) {
                    showEmptyText(mListView, mLoadingView, mEmptyView);
                } else {
                    setListAdaptor();
                    showContent(mListView, mLoadingView, mEmptyView);
                }
            }
            super.onPostExecute(result);
        }
    }

    public class SortIgnoreCase implements Comparator<String> {
        public int compare(String s1, String s2) {
            return s1.compareToIgnoreCase(s2);
        }
    }

    @Override
    protected void onSaveInstanceState(Bundle outState) {
        if (mListItems != null && mListItems.size() > 0) {
            outState.putStringArrayList("mListItems", mListItems);
        }
        if (mListSectionPos != null && mListSectionPos.size() > 0) {
            outState.putIntegerArrayList("mListSectionPos", mListSectionPos);
        }
        String searchText = mSearchView.getText().toString();
        if (searchText != null && searchText.length() > 0) {
            outState.putString("constraint", searchText);
        }
        super.onSaveInstanceState(outState);
    }

    @Override
    protected void destroyActivity() {

    }

    @Override
    protected void viewClick(View view) {
        if(view.getId() == R.id.btn_back){
            this.finish();
        }
    }
}
